
class HomePageAnswers:

    answer_1 = "Сутки — 400 рублей. Оплата курьеру — наличными или картой."
    answer_2 = "Пока что у нас так: один заказ — один самокат. Если хотите покататься с друзьями, можете просто сделать несколько заказов — один за другим."
    answer_3 = "Допустим, вы оформляете заказ на 8 мая. Мы привозим самокат 8 мая в течение дня. Отсчёт времени аренды начинается с момента, когда вы оплатите заказ курьеру. Если мы привезли самокат 8 мая в 20:30, суточная аренда закончится 9 мая в 20:30."
    answer_4 = "Только начиная с завтрашнего дня. Но скоро станем расторопнее."
    answer_5 = "Пока что нет! Но если что-то срочное — всегда можно позвонить в поддержку по красивому номеру 1010."
    answer_6 = "Самокат приезжает к вам с полной зарядкой. Этого хватает на восемь суток — даже если будете кататься без передышек и во сне. Зарядка не понадобится."
    answer_7 = "Да, пока самокат не привезли. Штрафа не будет, объяснительной записки тоже не попросим. Все же свои."
    answer_8 = "Да, обязательно. Всем самокатов! И Москве, и Московской области."

class OrderPageDataSets:

    data_sets = {
        'data_set1': {
            'first_name': 'Иван',
            'last_name': 'Иванов',
            'address': 'Улица Мира',
            'subway_name': 'ВДНХ',
            'telephone_number': '79054232343',
            'date': '30.04.2025',
            'rental_period': 0,
            'color': [0]
        },
        'data_set2':
            {'first_name': 'Ирина',
             'last_name': 'Иванова',
             'address': 'Улица Строителей',
             'subway_name': 'Печатники',
             'telephone_number': '89054232343',
             'date': '29.02.2024',
             'rental_period': 1,
             'color': [1]
             },
    }